# Group By

Pandas dataframe.groupby() fuction is used to split the data into groups based on some criteria. pandas objects can be split on any of thier axes. The abstract definition of grouping is to provide a mapping of labels to group names.

In [13]:
df=DataFrame({'D1':np.random.randn(5),'D2':np.random.randn(5),
              'K1':['X','X','Y','Y','Z'],
              'k2':['Alpha','Beta','Alpha','Beta','Alpha']})

In [14]:
df

         D1        D2 K1     k2
0  1.919764 -2.606234  X  Alpha
1 -1.171916 -2.695371  X   Beta
2  0.068346 -1.325896  Y  Alpha
3  1.153621 -0.963660  Y   Beta
4 -0.876045 -0.589291  Z  Alpha

## Type 1-Two column in one dataframe

In [16]:
df['D1'].groupby(df['K1'])

In [17]:
df['D1'].groupby(df['K1']).mean()

K1
X    0.373924
Y    0.610984
Z   -0.876045
Name: D1, dtype: float64

In [18]:
df['D1'].groupby(df['K1']).count()

K1
X    2
Y    2
Z    1
Name: D1, dtype: int64

In [19]:
df['D1'].groupby(df['K1']).max()

K1
X    1.919764
Y    1.153621
Z   -0.876045
Name: D1, dtype: float64

### Type 2- On the basis of Array and DataFrame

In [20]:
cities=np.array(['NY','LA','LA','NY','NY'])

In [21]:
cities

array(['NY', 'LA', 'LA', 'NY', 'NY'], dtype='<U2')

In [22]:
month=np.array(['JAN','FEB','JAN','FEB','JAN'])

In [24]:
month

array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'], dtype='<U3')

In [25]:
df['D2'].groupby([cities,month]).count()

LA  FEB    1
    JAN    1
NY  FEB    1
    JAN    2
Name: D2, dtype: int64

In [57]:
df['D2'].groupby([cities,month]).max()

LA  FEB   -2.695371
    JAN   -1.325896
NY  FEB   -0.963660
    JAN   -0.589291
Name: D2, dtype: float64

In [27]:
df['D2'].groupby([cities,month]).mean()

LA  FEB   -2.695371
    JAN   -1.325896
NY  FEB   -0.963660
    JAN   -1.597762
Name: D2, dtype: float64

### Type 3- On the basis of one column and full dataframe

In [39]:
df

         D1        D2 K1     k2
0  1.919764 -2.606234  X  Alpha
1 -1.171916 -2.695371  X   Beta
2  0.068346 -1.325896  Y  Alpha
3  1.153621 -0.963660  Y   Beta
4 -0.876045 -0.589291  Z  Alpha

In [29]:
df.groupby(['k2'])

In [30]:
df.groupby(['k2']).mean()

             D1        D2
k2
Alpha  0.370688 -1.507140
Beta  -0.009147 -1.829515

In [31]:
df.groupby(['K1']).mean()

          D1        D2
K1
X   0.373924 -2.650802
Y   0.610984 -1.144778
Z  -0.876045 -0.589291

In [32]:
df.groupby(['k2']).max()

             D1        D2 K1
k2
Alpha  1.919764 -0.589291  Z
Beta   1.153621 -0.963660  Y

In [33]:
df.groupby(['k2']).count()

       D1  D2  K1
k2
Alpha   3   3   3
Beta    2   2   2

### Type4- On the basis on 2 columns and full dataframe

In [38]:
df

         D1        D2 K1     k2
0  1.919764 -2.606234  X  Alpha
1 -1.171916 -2.695371  X   Beta
2  0.068346 -1.325896  Y  Alpha
3  1.153621 -0.963660  Y   Beta
4 -0.876045 -0.589291  Z  Alpha

In [34]:
df.groupby(['K1','k2'])

In [35]:
df.groupby(['K1','k2']).mean()

                D1        D2
K1 k2
X  Alpha  1.919764 -2.606234
   Beta  -1.171916 -2.695371
Y  Alpha  0.068346 -1.325896
   Beta   1.153621 -0.963660
Z  Alpha -0.876045 -0.589291

In [36]:
df.groupby(['K1','k2']).max()

                D1        D2
K1 k2
X  Alpha  1.919764 -2.606234
   Beta  -1.171916 -2.695371
Y  Alpha  0.068346 -1.325896
   Beta   1.153621 -0.963660
Z  Alpha -0.876045 -0.589291

In [37]:
df.groupby(['K1','k2']).count()

          D1  D2
K1 k2
X  Alpha   1   1
   Beta    1   1
Y  Alpha   1   1
   Beta    1   1
Z  Alpha   1   1

### Type 5- On the basis of Dictionary

In [42]:
df1=DataFrame(np.arange(16).reshape(4,4),columns=['W','X','Y','Z'],index=['DOG','CAT','COW','LION'])

In [43]:
df1

       W   X   Y   Z
DOG    0   1   2   3
CAT    4   5   6   7
COW    8   9  10  11
LION  12  13  14  15

In [44]:
d={'W':'GOOD','X':'BAD','Y':'GOOD','Z':'BAD'}

In [46]:
d

{'W': 'GOOD', 'X': 'BAD', 'Y': 'GOOD', 'Z': 'BAD'}

In [51]:
df1.replace({4:np.nan,6:np.nan},inplace=True) #df1.iloc[1,0]=np.nan

In [52]:
df1

         W     X     Y     Z
DOG    0.0   1.0   2.0   3.0
CAT    NaN   5.0   NaN   7.0
COW    8.0   9.0  10.0  11.0
LION  12.0  13.0  14.0  15.0

In [53]:
df1.groupby(d,axis=1).count()

      BAD  GOOD
DOG     2     2
CAT     2     0
COW     2     2
LION    2     2

In [54]:
df1.groupby(d,axis=1).sum()

       BAD  GOOD
DOG    4.0   2.0
CAT   12.0   0.0
COW   20.0  18.0
LION  28.0  26.0

### Type 6-On the basis of Function

In [55]:
df1.groupby(len).sum()

      W     X     Y     Z
3   8.0  15.0  12.0  21.0
4  12.0  13.0  14.0  15.0

df['col name'].groupby([]).mean/max/count()